<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Pandas Basics II

## 1.0 Importing the Libraries to be used

In [2]:
# Let's import the pandas library
#
# OUR CODE GOES HERE
import pandas as pd
# as well as the Numpy library
import numpy as np

# OUR CODE GOES HERE

## 1.1 Loading our Datasets

In [3]:
# Example 1
# We will begin learning how we can load datasets from different types of sources
# Let's first begin with loading datasets from a JSON file 
#


# First, we get the URL to the JSON file (alternatively this can be a filepath)
url = 'https://raw.githubusercontent.com/algolia/datasets/master/airports/airports.json'

# Then load, the first sheet of the JSON file into a data frame. 
# We are going to use pandas read_json method. This method works the same as read_csv. You can read more about it from the documentation: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_json.html
df = pd.read_json(url, orient='columns')

# Lastly, view the first ten rows
df.head(10)

,name,city,country,iata_code,_geoloc,links_count,objectID
0,Hartsfield Jackson Atlanta Intl,Atlanta,United States,ATL,"{'lat': 33.636719, 'lng': -84.428067}",1826,3682
1,Chicago Ohare Intl,Chicago,United States,ORD,"{'lat': 41.978603, 'lng': -87.904842}",1108,3830
2,Capital Intl,Beijing,China,PEK,"{'lat': 40.080111, 'lng': 116.584556}",1069,3364
3,Heathrow,London,United Kingdom,LHR,"{'lat': 51.4775, 'lng': -0.461389}",1051,507
4,Charles De Gaulle,Paris,France,CDG,"{'lat': 49.012779, 'lng': 2.55}",1041,1382
5,Los Angeles Intl,Los Angeles,United States,LAX,"{'lat': 33.942536, 'lng': -118.408075}",990,3484
6,Frankfurt Main,Frankfurt,Germany,FRA,"{'lat': 50.026421, 'lng': 8.543125}",990,340
7,Dallas Fort Worth Intl,Dallas-Fort Worth,United States,DFW,"{'lat': 32.896828, 'lng': -97.037997}",936,3670
8,John F Kennedy Intl,New York,United States,JFK,"{'lat': 40.639751, 'lng': -73.778925}",911,3797
9,Schiphol,Amsterdam,Netherlands,AMS,"{'lat': 52.308613, 'lng': 4.763889}",903,580

In [5]:
# Example 2
# We can also load an Excel file as shown below
# 

# We create a URL to Excel file (alternatively this can be a filepath)
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.xlsx'

# Then load the first sheet of the Excel file into a data frame
df = pd.read_excel(url, sheet_name=0, header=1)

# Lastly, view the first ten rows
df.head(10)

   5 2015-01-01 00:00:00  0
0  5 2015-01-01 00:00:01  0
1  9 2015-01-01 00:00:02  0
2  6 2015-01-01 00:00:03  0
3  6 2015-01-01 00:00:04  0
4  9 2015-01-01 00:00:05  0
5  7 2015-01-01 00:00:06  0
6  1 2015-01-01 00:00:07  0
7  6 2015-01-01 00:00:08  0
8  9 2015-01-01 00:00:09  0
9  5 2015-01-01 00:00:10  0

In [25]:
# Example 3
# We can also load A CSV Into pandas
# 

# We create a csv file or import from a url

# First, creating a dataframe (that we will be importing)
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Jacobson', ".", 'Milner', 'Cooze'], 
        'age': [42, 52, 36, 24, 73], 
        'preTestScore': [4, 24, 31, ".", "."],
        'postTestScore': ["25,000", "94,000", 57, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])
df

# Saving the above dataframe as csv in the working directory
df.to_csv('example.csv')

# Loading a csv
df = pd.read_csv('example.csv')
df

# Loading a csv with no headers
# Uncomment the lines below after running previous lines.
df = pd.read_csv('example.csv', header=None) 
df

# Loading a csv while specifying column names
# Uncomment the lines below after running previous lines.
df = pd.read_csv('example.csv', names=['UID', 'First Name', 'Last Name', 'Age', 'Pre-Test Score', 'Post-Test Score'])
df

# Loading a csv while setting the index columns to First Name and Last Name
# Uncomment the lines below after running previous lines.
df = pd.read_csv('example.csv', index_col=['First Name', 'Last Name'], names=['UID', 'First Name', 'Last Name', 'Age', 'Pre-Test Score', 'Post-Test Score'])
df

# Loading a csv while specifying “.” and “NA” as missing values in the Last Name column and “.” as missing values in Pre-Test Score column
# Uncomment the lines below after running previous lines.
sentinels = {'Last Name': ['.', 'NA'], 'Pre-Test Score': ['.']}
df = pd.read_csv('example.csv', na_values=sentinels)
df

   Unnamed: 0 first_name last_name  age preTestScore postTestScore
0           0      Jason    Miller   42            4        25,000
1           1      Molly  Jacobson   52           24        94,000
2           2       Tina         .   36           31            57
3           3       Jake    Milner   24            .            62
4           4        Amy     Cooze   73            .            70

### <font color="green">1.1 Challenges</font>

In [27]:
# Challenge 1
# Load the first 10 records of the JSON file from the following url


url = "https://raw.githubusercontent.com/dariusk/corpora/master/data/books/academic_subjects.json"
frame = pd.read_json(url)
frame.head(10)

,description,source,subjects
0,Academic subjects,Classification of Instructional Programs (CIP ...,Accounting
1,Academic subjects,Classification of Instructional Programs (CIP ...,Administration of Special Education
2,Academic subjects,Classification of Instructional Programs (CIP ...,Adult & Continuing Teacher Education
3,Academic subjects,Classification of Instructional Programs (CIP ...,Advertising
4,Academic subjects,Classification of Instructional Programs (CIP ...,African Studies
5,Academic subjects,Classification of Instructional Programs (CIP ...,Afro-American Studies
6,Academic subjects,Classification of Instructional Programs (CIP ...,Agricultural Economics
7,Academic subjects,Classification of Instructional Programs (CIP ...,Agricultural Engineering
8,Academic subjects,Classification of Instructional Programs (CIP ...,Agronomy & Crop Science
9,Academic subjects,Classification of Instructional Programs (CIP ...,Native American Studies

In [28]:
# Challenge 2
# Preview the excel spreadsheet from the following url

url = "http://ww2.amstat.org/publications/jse/v20n3/delzell/conflictdata.xlsx"
frame = pd.read_excel(url)
frame

,Year,EventType,Actor1,Actor2,Country,Region,Location,ConflictLat,ConflictLong,StationID,YrMoDy,MaxTemp,StationName,StationLong,StationLat,TempCat
0,2005,Riots,Protesters (Algeria),NaN,Algeria,Chlef,Sidi Ammar,36.47,1.45,604300,20050125,35.79,MILIANA,2.23,36.29,C
1,2003,Riots,Protesters (Algeria),NaN,Algeria,NaN,Tadjenanet,36.11,5.98,604680,20030201,38.50,BATNA,6.31,35.75,C
2,2002,Battles,Military Forces of Ethiopia (1991-),ONLF: Ogaden National Liberation Front,Ethiopia,Degeh Bur,Afweyne,9.38,43.06,696754,20020224,39.20,CAMP LEMONIER,43.15,11.55,C
3,2003,Riots,Protesters (Algeria),Police Forces of Algeria (1999-),Algeria,Bordj Bou Arreridj,Bordj Bou Arerridj,36.07,4.77,604440,20030217,39.40,BORDJ-BOU-ARRERIDJ,4.76,36.06,C
4,1999,Violence against civilians,GIA: Armed Islamic Group of Algeria,Civilians (Algeria),Algeria,Relizane,Relizane,35.74,0.55,605060,19991217,39.90,MASCARA-MATEMORE,0.30,35.59,C
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
35968,2007,Violence against civilians,FDLR: Democratic Forces for the Liberation of ...,Civilians (DRC),Democratic Republic of Congo,Kivu,Bukavu,-2.50,28.86,643900,20070601,48.20,BUJUMBURA,29.31,-3.31,C
35969,2007,Battles,Military Forces of Democratic Republic of Cong...,FDLR: Democratic Forces for the Liberation of ...,Democratic Republic of Congo,Kivu,Bukavu,-2.50,28.86,643900,20070609,48.20,BUJUMBURA,29.31,-3.31,C
35970,2007,Battles,Unidentified Armed Group (Nigeria),Military Forces of Nigeria-Joint Task Force (2...,Nigeria,Delta State,Niger Delta,5.32,6.47,648100,20070904,75.19,MALABO,8.76,3.75,C
35971,2007,Violence against civilians,Unidentified Armed Group (Nigeria),Civilians (Nigeria),Nigeria,Oyo State,Ibadan,7.38,3.89,652010,20070912,75.19,LAGOS/IKEJA,3.33,6.58,C
35972,2007,Violence against civilians,Unidentified Armed Group (Nigeria),Civilians (Nigeria),Nigeria,Oyo State,Oyo State,8.00,4.00,652010,20070912,75.19,LAGOS/IKEJA,3.33,6.58,C

In [33]:
# Challenge 3
# Download and upload the csv file from this url (http://bit.ly/NairobiBusesDataset) (Not Load from Url)
# Then preview the dataset while specifying column names 
# 
data_url =  'http://bit.ly/NairobiBusesDataset'
frame = pd.read_csv(data_url)
frame['ride_id']

0         1442
1         5437
2         5710
3         5777
4         5778
         ...
51640    13826
51641    13809
51642    13809
51643    13796
51644    14304
Name: ride_id, Length: 51645, dtype: int64

In [41]:
# Challenge 4 
# Create a Dataframe from the following dictionary then fill in the missing values with "."
#
import numpy as np
import pandas as pd
# Dictionary
dict = {'First Score':[100, 90, np.nan, 95], 
        'Second Score': [30, 45, 56, np.nan], 
        'Third Score':[np.nan, 40, 80, 98]}
frame = pd.DataFrame(dict)
frame.fillna('.', inplace=True)
frame

  First Score Second Score Third Score
0         100           30           .
1          90           45          40
2           .           56          80
3          95            .          98

## 1.2 Exploration

In [47]:
# Example 1
# We will now see how we can filter pandas Dataframes as shown below
# 

# Creating the following Dataframe
data = {'name': ['Kevin', 'Jane', 'Mary', 'Jared', 'Elizabeth'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3],
        'coverage': [25, 94, 57, 62, 70]}
df = pd.DataFrame(data, index = ['Nairobi', 'Nakuru', 'Kisumu', 'Kericho', 'Eldoret'])
df

# Viewing a column
# Uncomment the line below after running previous line
df['name']

# Viewing two Columns
# Uncomment the line below after running previous line
df[['name', 'reports']]

# Viewing the first two Rows
# Uncomment the line below after running previous line
df[:2]

# Viewing rows where coverage is greater than 50
# Uncomment the line below after running previous line
df[df['coverage'] > 50]


# Viewing rows where coverage is greater than 50 and reports less than 4
# Uncomment the line below after running previous line
df[(df['coverage']  > 50) & (df['reports'] < 4)]

              name  year  reports  coverage
Kericho      Jared  2014        2        62
Eldoret  Elizabeth  2014        3        70

In [49]:
# Example 2
# Then find the largest value in a Dataframe column
# 

# First creating a Dataframe
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'], 
        'age': [42, 52, 36, 24, 73], 
        'preTestScore': [4, 24, 31, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])
df

# Then Indexing of the row with the highest value in the preTestScore column
# Uncomment the line below after running previous line
df['preTestScore'].max()

31

In [51]:
# Example 3
# Finding also Unique Values In the Pandas Dataframes
import numpy as np

# First creating a Dataframe from a Dictionary
raw_data = {'regiment': ['51st', '29th', '2nd', '19th', '12th', '101st', '90th', '30th', '193th', '1st', '94th', '91th'], 
            'trucks': ['MAZ-7310', np.nan, 'MAZ-7310', 'MAZ-7310', 'Tatra 810', 'Tatra 810', 'Tatra 810', 'Tatra 810', 'ZIS-150', 'Tatra 810', 'ZIS-150', 'ZIS-150'],
            'tanks': ['Merkava Mark 4', 'Merkava Mark 4', 'Merkava Mark 4', 'Leopard 2A6M', 'Leopard 2A6M', 'Leopard 2A6M', 'Arjun MBT', 'Leopard 2A6M', 'Arjun MBT', 'Arjun MBT', 'Arjun MBT', 'Arjun MBT'],
            'aircraft': ['none', 'none', 'none', 'Harbin Z-9', 'Harbin Z-9', 'none', 'Harbin Z-9', 'SH-60B Seahawk', 'SH-60B Seahawk', 'SH-60B Seahawk', 'SH-60B Seahawk', 'SH-60B Seahawk']}
df = pd.DataFrame(raw_data, columns = ['regiment', 'trucks', 'tanks', 'aircraft'])
df

# Viewing the top few rows
# Uncomment the line below after running previous lines
df.head()

# We can create a list of unique values by turning the pandas column into a set
# Uncomment the line below after running previous lines
list(set(df.trucks))

# Here's another way of creating a list of unique values in df.trucks
# Uncomment the line below after running previous lines
list(df['trucks'].unique())

['MAZ-7310', nan, 'Tatra 810', 'ZIS-150']

In [52]:
# Example 4
# listing Unique Values In A pandas Column
#

# Create an example dataframe
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

# List unique values in the df['name'] column
# Uncomment the line below after running previous lines
df.name.unique()

array(['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], dtype=object)

In [57]:
# Example 5
# Grouping Rows In pandas
# 

# Creating a Dataframe
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'name', 'preTestScore', 'postTestScore'])
df

# Creating a grouping object. In other words, create an object that
# represents that particular grouping. In this case we group
# pre-test scores by the regiment.
# Uncomment the line below after running previous lines
regiment_preScore = df['preTestScore'].groupby(df['regiment'])

# Displaying the mean value of the each regiment's pre-test score
# Uncomment the line below after running previous lines
regiment_preScore.mean()

regiment
Dragoons      15.50
Nighthawks    15.25
Scouts         2.50
Name: preTestScore, dtype: float64

### <font color="green"> 1.2 Challenges</font>

In [68]:
# Challenge 1
# Let us view the following Dataframe upon creation from the following Dictionary
#
data = {'name': ['Alice', 'Robert', 'Charles', 'David', 'Eric'],
        'year of joining': [2014, 2015, 2013, 2014, 2013],
        'salary': [40000, 25000, 35000, 200000, 30000]}
df = pd.DataFrame(data, index = ['I&M', 'I&M', 'KCB', 'KCB', 'KCB'])
df

# Let us view salary column
df['salary']

# We would like to compare the name and the salary columns
df[['salary', 'name']]

# Let's view the first three records of the dataframe
df.head(3)

# Which employee(s) earn(s) a salary of more than 30000
df[df['salary'] > 30000]

# Which employee(s) earn(s) a salary of less than 30000 and joined before 2015
df[(df['salary'] > 30000) & (df['year of joining'])]

        name  year of joining  salary
KCB  Charles             2013   35000

In [77]:
# Challenge 2
# Find out the person with greatest age from the Dataframe that you will create
# upon creating the Dictionary below
# 

# Create a DataFrame
df = {'Name':['Audrey','Kwasi','Parul','Lohinee','James','Catherine',
'Val','Robert','Alex','Alisa','Murkomen','Judy'],
'Age':[26,24,23,22,23,24,26,24,22,23,24,24],
'Score':[85,63,55,74,31,77,85,63,42,62,89,77]}

frame = pd.DataFrame(df)
frame[frame['Age'] == frame['Age'].max()]

     Name  Age  Score
0  Audrey   26     85
6     Val   26     85

In [79]:
# Challenge 3
# Get the unique values of the continent column from the Dataset below

url = 'http://bit.ly/FiveYearData'
frame = pd.read_csv(url)
frame

          country  year         pop continent  lifeExp   gdpPercap
0     Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1     Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2     Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3     Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4     Afghanistan  1972  13079460.0      Asia   36.088  739.981106
...           ...   ...         ...       ...      ...         ...
1699     Zimbabwe  1987   9216418.0    Africa   62.351  706.157306
1700     Zimbabwe  1992  10704340.0    Africa   60.377  693.420786
1701     Zimbabwe  1997  11404948.0    Africa   46.809  792.449960
1702     Zimbabwe  2002  11926563.0    Africa   39.989  672.038623
1703     Zimbabwe  2007  12311143.0    Africa   43.487  469.709298

[1704 rows x 6 columns]

In [84]:
# Challenge 4
# How many countries are there in the dataset on challenge 3
# 
countries = len(set(frame['country']))
countries

142

In [98]:
# Challenge 5
# What is the average number of goals per teams from the dictionary below
# 

# Creating our dataframe
football = {'Team':['Arsenal', 'Manchester United', 'Arsenal', 
                   'Arsenal', 'Chelsea', 'Manchester United', 
                   'Manchester United', 'Chelsea', 'Chelsea', 'Chelsea'],     
           'Player':['Ozil', 'Pogba', 'Lucas', 'Aubameyang', 
                       'Hazard', 'Mata', 'Lukaku', 'Morata',  
                                         'Giroud', 'Kante'],                          
           'Goals':[6, 4, 7, 5, 10, 3, 1, 6, 3, 4]} 

frame = pd.DataFrame(football)
frame['Goals'].groupby(frame['Team']).mean()

Team
Arsenal              6.000000
Chelsea              5.750000
Manchester United    2.666667
Name: Goals, dtype: float64

## 1.3 Selecting and Sorting

In [99]:
# Example 1
# In this section, we will select and sort our dataframes
# We will start off by ranking Rows Of Pandas Dataframes as shown 
#

# Creating dataframe
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3],
        'coverage': [25, 94, 57, 62, 70]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

# Creating a new column that is the rank of the value of coverage in ascending order
# Uncomment the line below after running previous lines
df['coverageRanked'] = df['coverage'].rank(ascending=1)
df

             name  year  reports  coverage  coverageRanked
Cochice     Jason  2012        4        25             1.0
Pima        Molly  2012       24        94             5.0
Santa Cruz   Tina  2013       31        57             2.0
Maricopa     Jake  2014        2        62             3.0
Yuma          Amy  2014        3        70             4.0

In [102]:
# Example 2
# Next, we will Select Rows When Columns that Contain Certain Values
# 

# Create an example dataframe
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

# Get rows where column has certain values
# Uncomment the line below after running previous lines
value_list = ['Tina', 'Molly', 'Jason']
df[df.name.isin(value_list)]

# Get rows where column doesn't have certain values
# Uncomment the line below after running previous lines
df[~df.name.isin(value_list)]

          name  year  reports
Maricopa  Jake  2014        2
Yuma       Amy  2014        3

In [104]:
# Example 3
# Then, Select Rows With A Certain Value

# Create an example dataframe
data = {'name': ['Jason', 'Molly'], 
        'country': [['Syria', 'Lebanon'],['Spain', 'Morocco']]}
df = pd.DataFrame(data)
df

# Uncomment the line below after running previous lines
df[df['country'].map(lambda country: 'Syria' in country)]

    name           country
0  Jason  [Syria, Lebanon]

In [105]:
# Example 4
# Select Rows With Multiple Filters
#

# Create an example dataframe
data = {'name': ['A', 'B', 'C', 'D', 'E'], 
        'score': [1,2,3,4,5]}
df = pd.DataFrame(data)
df

# Select rows of the dataframe where df.score is greater than 1 and less and 5
# Uncomment the line below after running previous lines
df[(df['score'] > 1) & (df['score'] < 5)]

  name  score
1    B      2
2    C      3
3    D      4

In [109]:
# Example 5
# Selecting DataFrame Rows Based On Conditions
# 

# import numpy
import numpy as np

# Creating a dataframe
raw_data = {'first_name': ['Jason', 'Molly', np.nan, np.nan, np.nan], 
        'nationality': ['USA', 'USA', 'France', 'UK', 'UK'], 
        'age': [42, 52, 36, 24, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'nationality', 'age'])
df

# Method 1: Using Boolean Variables
# Create variable with TRUE if nationality is USA
# Uncomment the line below after running previous lines
american = df['nationality'] == "USA"

# Create variable with TRUE if age is greater than 50
# Uncomment the line below after running previous lines
elderly = df['age'] > 50

# Select all cases where nationality is USA and age is greater than 50
# Uncomment the line below after running previous lines 
df[american & elderly]


# Method 2: Using variable attributes
# Select all cases where the first name is not missing and nationality is USA
# Uncomment the line below after running previous lines
df[df['first_name'].notnull() & (df['nationality'] == "USA")]

  first_name nationality  age
1      Molly         USA   52

In [112]:
# Example 6
# Sorting Rows In pandas Dataframes
# 

# Creating a Dataframe to work with
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [1, 2, 1, 2, 3],
        'coverage': [2, 2, 3, 3, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

# Sort the dataframe’s rows by reports, in descending order
# Uncomment the line below after running previous lines
df.sort_values(by='reports', ascending=0)

# Sort the dataframe’s rows by coverage and then by reports, in ascending order
# Uncomment the line below after running previous lines
df.sort_values(by=['coverage', 'reports'])

             name  year  reports  coverage
Cochice     Jason  2012        1         2
Pima        Molly  2012        2         2
Santa Cruz   Tina  2013        1         3
Maricopa     Jake  2014        2         3
Yuma          Amy  2014        3         3

### <font color="green">1.3 Challenges</font>

In [119]:
# Challenge 1
# Create a new column ranking the following cars by price 
# 

Cars = {'Brand': ['Honda Civic', 'Toyota Corolla', 'Ford Focus', 'Audi A4'],
        'Price': [22000, 25000, 27000, 35000],
        'Year': [2015, 2013, 2018, 2018]}

frame = pd.DataFrame(Cars)
frame['ranking'] = frame['Price'].rank(ascending=0)
frame

            Brand  Price  Year  ranking
0     Honda Civic  22000  2015      4.0
1  Toyota Corolla  25000  2013      3.0
2      Ford Focus  27000  2018      2.0
3         Audi A4  35000  2018      1.0

In [138]:
# Challenge 2
# Let's get the rows when the column contains certain values
#

data = {'model': ['Lisa', 'Lisa 2', 'Macintosh 128K', 'Macintosh 512K'],
        'launched': [1983, 1984, 1984, 1984],
        'discontinued': [1986, 1985, 1984, 1986]}
columns = ['model', 'launched', 'discontinued']

# Get the rows where the column model contains Lisa
frame = pd.DataFrame(data, columns=columns)
where_lisa = frame['model'].map(lambda model: 'Lisa' in model)
frame[where_lisa] 

# Get the rows where the column model does not contain Macintosh 128K
frame[~(frame['model'] == 'Macintosh 128K')]

            model  launched  discontinued
0            Lisa      1983          1986
1          Lisa 2      1984          1985
3  Macintosh 512K      1984          1986

In [161]:
# Challenge 3
# Select the rows with the value blue or yellow from the Dataframe below
#
data = {'name': ['Willam', 'Alex', 'Oliech', 'Julie'],
'age': [20, 19, 22, 21],
'favorite_color': ['blue', 'blue', 'yellow', "green"],
'grade': [88, 92, 95, 70]}

frame =  pd.DataFrame(data)
frame[(frame['favorite_color'] == 'blue') | (frame['favorite_color'] == 'yellow')]

     name  age favorite_color  grade
0  Willam   20           blue     88
1    Alex   19           blue     92
2  Oliech   22         yellow     95

In [1]:
# Challenge 4
# Using the following dataset, which counties have less than 50,000 households?
# 
# This dataset shows the distribution of households based on their age group, gender and household head.

url = "http://bit.ly/KeHouseholds1"
frame = pd.read_excel(url)
frame

NameError: name 'pd' is not defined

In [177]:
# Challenge 5
# Using the following dataset, Which top 3 municipalities have the highest population?
#
# 
url = 'http://bit.ly/KePopulationDistribution1'
frame = pd.read_csv(url, error_bad_lines=False)
frame

b'Skipping line 130: expected 280 fields, saw 393\n'

,"<!DOCTYPE html><html><head><meta name=""google"" content=""notranslate""><meta http-equiv=""X-UA-Compatible"" content=""IE=edge;""><style>@font-face{font-family:'Roboto';font-style:italic;font-weight:400;src:local('Roboto Italic')",local('Roboto-Italic'),url(//fonts.gstatic.com/s/roboto/v18/KFOkCnqEu92Fr1Mu51xIIzc.ttf)format('truetype');}@font-face{font-family:'Roboto';font-style:normal;font-weight:300;src:local('Roboto Light'),local('Roboto-Light'),url(//fonts.gstatic.com/s/roboto/v18/KFOlCnqEu92Fr1MmSU5fBBc9.ttf)format('truetype');}@font-face{font-family:'Roboto';font-style:normal;font-weight:400;src:local('Roboto Regular'),local('Roboto-Regular'),url(//fonts.gstatic.com/s/roboto/v18/KFOmCnqEu92Fr1Mu4mxP.ttf)format('truetype');}@font-face{font-family:'Roboto';font-style:normal;font-weight:700;src:local('Roboto Bold'),local('Roboto-Bold'),"url(//fonts.gstatic.com/s/roboto/v18/KFOlCnqEu92Fr1MmWUlfBBc9.ttf)format('truetype');}</style><meta name=""referrer"" content=""origin""><title>Population_Distribution_by_Sex_in_Urban_Centres_and_Status_of_Centre__2009.csv - Google Drive</title><meta property=""og:title"" content=""Population_Distribution_by_Sex_in_Urban_Centres_and_Status_of_Centre__2009.csv""><meta property=""og:type"" content=""article""><meta property=""og:site_name"" content=""Google Docs""><meta property=""og:url"" content=""https://drive.google.com/a/moringaschool.com/file/d/1D96KJE2c5WFm1gqYbipKLC0J2aLwEt5p/view?usp=sharing&amp;usp=embed_facebook""><link rel=""shortcut icon"" href=""https://ssl.gstatic.com/docs/doclist/images/icon_14_text_favicon.ico""><link rel=""stylesheet"" href=""https://fonts.googleapis.com/css?family=Google+Sans:300",400,...,null.13,AIzaSyC1eQ1xj69IdTMeii5r7brs3R90eck-m7k,0.3,/drive/v2beta,0.4,0.5,1.5,[0,0.6,0].1
0,NaN,NaN,1,NaN,0,1],NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,5,1,NaN,NaN,1,https://drive.google.com,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,6,1,1,NaN,NaN,NaN,1],NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,1,NaN,NaN,[null,NaN,NaN,NaN,https://accounts.google.com/ServiceLogin?servi...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,1,NaN,NaN,https://docs.google.com,NaN,1,[null,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
173,(function(){var a=_.yd();if(_.C(a,18))Lj();else{var c=_.B(a,"19)||0;window.addEventListener(""load""",function(){window.setTimeout(Lj,c)})}})();,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
174,}catch(e){_._DumpException(e)},NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
175,})(this.gbar_);,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
176,// Google Inc.,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
177,"</script><script id=""base-js"" async type=""text...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [0]:
# Challenge 6
# Using the dataset given in challenge 5, sort the rows by the total core urban population 
#
OUR CODE GOES HERE

In [0]:
# Challenge 7
# Using the following dataset, Which quarter experienced the highest no. of visitors after 2007
# url = http://bit.ly/VisitorsToKenya
# This dataset comprises of visitor arrivals and departures Between 1991 up to 2014 by the purpose of visiting Kenya
# 
OUR CODE GOES HERE

## 1.4 Cleaning

In [181]:
# Example 1
# Assign a new column to a Pandas DataFrame
# 

# Create empty dataframe
df = pd.DataFrame() 
df['name'] = ['John', 'Steve', 'Sarah'] 
df
 
# Assign a new column to df called 'age' with a list of ages
# Uncomment the line below after running previous lines
df.assign(age = [31, 32, 19], car=['Merc', 'Range','Chevrolet'])

    name  age        car
0   John   31       Merc
1  Steve   32      Range
2  Sarah   19  Chevrolet

In [184]:
# Example 2
# Lowercase column names in Pandas Dataframe
#

# Let's first set ipython's max row display
pd.set_option('display.max_row', 1000)

# Let's first set iPython's max column width to 50
pd.set_option('display.max_columns', 50)

# Create an example dataframe
data = {'NAME': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'YEAR': [2012, 2012, 2013, 2014, 2014], 
        'REPORTS': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df
 
# Map the lowering function to all column names
# Uncomment the line below after running previous lines
df.columns = map(str.lower, df.columns)
df

             name  year  reports
Cochice     Jason  2012        4
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31
Maricopa     Jake  2014        2
Yuma          Amy  2014        3

In [188]:
# Example 3
# While doing data analysis, finding duplicates in your data is very important. 
# Delete duplicates in pandas
#


# Create dataframe with duplicates
raw_data = {'first_name': ['Jason', 'Jason', 'Jason','Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Miller', 'Miller','Ali', 'Milner', 'Cooze'], 
        'age': [42, 42, 1111111, 36, 24, 73], 
        'preTestScore': [4, 4, 4, 31, 2, 3],
        'postTestScore': [25, 25, 25, 57, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])
df

# Identify which observations are duplicates
# Uncomment the line below after running previous lines
df.duplicated()

# Drop duplicates
# Uncomment the line below after running previous lines
df.drop_duplicates()

# Drop duplicates in a specific column
# Uncomment the line below after running previous lines
df.drop_duplicates(['first_name'], keep='last')
df

  first_name last_name      age  preTestScore  postTestScore
0      Jason    Miller       42             4             25
1      Jason    Miller       42             4             25
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

In [197]:
# Example 4
# Another crucial part of data analysis is finding missing data and deleting them. Let's lookd at how to deal with missing data 
# Missing data in pandas Dataframes
#

raw_data = {'first_name': ['Jason', np.nan, 'Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', np.nan, 'Ali', 'Milner', 'Cooze'], 
        'age': [42, np.nan, 36, 24, 73], 
        'sex': ['m', np.nan, 'f', 'm', 'f'], 
        'preTestScore': [4, np.nan, np.nan, 2, 3],
        'postTestScore': [25, np.nan, np.nan, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'sex', 'preTestScore', 'postTestScore'])
df

# Checking if there are missing values in your data
# Uncomment the line below after running previous lines
df.isnull() #returns a boolean value for all the cells that have Nan  value


# Drop missing observations
# Uncomment the line below after running previous lines
df_no_missing = df.dropna()
df_no_missing

# Drop rows where all cells in that row is NA
# Uncomment the line below after running previous lines
df_cleaned = df.dropna(how='all')
df_cleaned

# Drop column if they only contain missing values
# Uncomment the line below after running previous lines
df.dropna(axis=1, how='all')

# Drop rows that contain less than five observations
# Uncomment the line below after running previous lines
df.dropna(thresh=5)

# Fill in missing data with zeros
# Uncomment the line below after running previous lines
df.fillna(0)

# Fill in missing in preTestScore with the mean value of preTestScore
# Uncomment the line below after running previous lines
df["preTestScore"].fillna(df["preTestScore"].mean(), inplace=True)
df

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           3.0            NaN
2       Tina       Ali  36.0    f           3.0            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [200]:
# Example 5
# Dropping rows and columns in pandas Dataframe
#

# Create a dataframe
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

# Drop an observation (row)
# Uncomment the line below after running previous lines
df.drop(['Cochice', 'Pima'])

# Drop a variable (column). 
# NB: axis=1 denotes that we are referring to a column, not a row
# Uncomment the line below after running previous lines
df.drop('reports', axis=1)

# Drop a row if it contains a certain value (in this case, “Tina”)
# Create a new dataframe called df that includes all rows where 
# the value of a cell in the name column does not equal “Tina”
# Uncomment the line below after running previous lines
df[df.name != 'Tina']

           name  year  reports
Cochice   Jason  2012        4
Pima      Molly  2012       24
Maricopa   Jake  2014        2
Yuma        Amy  2014        3

### <font color="green">1.4 Challenges</font>

In [202]:
# Challenge 1
# Let's assign the new column address to the created dataframe frow the dictionary below
#

# Define a dictionary containing Students data 
finals = {'Name': ['Robert', 'Thomas', 'Susan', 'Irene'], 
        'Height': [5.1, 6.2, 5.1, 5.2], 
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']} 
address = ['UoN', 'Strathmore', 'JKUAT', 'JKUAT'] 

frame = pd.DataFrame(finals)
frame['address'] = address
frame

     Name  Height Qualification     address
0  Robert     5.1           Msc         UoN
1  Thomas     6.2            MA  Strathmore
2   Susan     5.1           Msc       JKUAT
3   Irene     5.2           Msc       JKUAT

In [210]:
# Challenge 2
# Let us lowercase the column names in the following dataset

url = 'http://bit.ly/KePopulationDistribution1'

frame = pd.read_csv(url, sep=',', error_bad_lines=True)
frame

URLError: <urlopen error [Errno 11004] getaddrinfo failed>

In [212]:
# Challenge 3
# Delete duplicate values from the dictionary below
# 

# First creating the following DataFrame
d = {
    'Name':['Alice','Brian','Rhoda','Pauline','Julius','Catherine',
            'Alice','Brian','Kellen','Alice','Alex','Yvonne'],
    'Age':[26,24,23,22,23,24,26,24,22,23,24,24],
    'Score':[85,63,55,74,31,77,85,63,42,62,89,77]}

frame =  pd.DataFrame(d)
frame.drop_duplicates()

         Name  Age  Score
0       Alice   26     85
1       Brian   24     63
2       Rhoda   23     55
3     Pauline   22     74
4      Julius   23     31
5   Catherine   24     77
8      Kellen   22     42
9       Alice   23     62
10       Alex   24     89
11     Yvonne   24     77

In [218]:
# Challenge 4
# Drop the missing columns 
#

# Creating our DataFrame
df = {'Name':['George','Andrea','micheal','maggie','Ravi','Xien','Jalpa',np.nan],
    'State':['Arizona','Georgia','Newyork','Indiana','Florida','California',np.nan,np.nan],
    'Gender':["M","F","M","F","M","M",np.nan,np.nan],      
    'Score':[63,48,56,75,np.nan,77,np.nan,np.nan]}

# Drop all rows that have any NaN (missing) values
frame =  pd.DataFrame(df)
frame.dropna()

# Drop records which have more than 2 missing values

frame = pd.DataFrame(df)
frame.dropna(thresh = 2)

      Name       State Gender  Score
0   George     Arizona      M   63.0
1   Andrea     Georgia      F   48.0
2  micheal     Newyork      M   56.0
3   maggie     Indiana      F   75.0
4     Ravi     Florida      M    NaN
5     Xien  California      M   77.0

In [0]:
# Challenge 5
# Using the following dataset given, get the records which contain missing observations,
# then make a decision which records to delete based on the context.
# Act on the decision taken (i.e. Drop/Not dropping) and state your decision below
# url = http://bit.ly/KePopulationDistribution1
# 

OUR CODE GOES HERE

# Decision Taken:
# YOUR DECISION GOES HERE
#

## 1.5 Analysis

In [220]:
# Example 1
# Descriptive Statistics For pandas Dataframe
#

data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'age': [42, 52, 36, 24, 73], 
        'preTestScore': [4, 24, 31, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70]}
df = pd.DataFrame(data, columns = ['name', 'age', 'preTestScore', 'postTestScore'])
df


# The sum of all the ages
# Uncomment the line below after running previous lines
# df['age'].sum()

# Mean preTestScore
# Uncomment the line below after running previous lines
# df['preTestScore'].mean()

# Cumulative sum of preTestScores, moving from the rows from the top
# Uncomment the line below after running previous lines
# df['preTestScore'].cumsum()

# Summary statistics on preTestScore
# Uncomment the line below after running previous lines.
# The output for this summary will be; the total number of rows there is in the column, the mean value for the data in the column, 
# the standard deviation of the data , min and max values of the data, the 25th 50th 75th percentile of the data.
df['preTestScore'].describe()

# Count the number of non-NA values
# Uncomment the line below after running previous lines
# df['preTestScore'].count()

# Minimum value of preTestScore
# Uncomment the line below after running previous lines
# df['preTestScore'].min()

# Maximum value of preTestScore
# Uncomment the line below after running previous lines
# df['preTestScore'].max()

# Median value of preTestScore
# Uncomment the line below after running previous lines
# df['preTestScore'].median()

# Sample variance of preTestScore values
# Uncomment the line below after running previous lines
# df['preTestScore'].var()

# Sample standard deviation of preTestScore values
# Uncomment the line below after running previous lines
# df['preTestScore'].std()

# Skewness of preTestScore values
# Uncomment the line below after running previous lines
# df['preTestScore'].skew()

# Kurtosis of preTestScore values
# Uncomment the line below after running previous lines
# df['preTestScore'].kurt()

# Correlation Matrix Of Values
# A correlation matrix is a table showing correlation coefficents of different variables. In other words, it shows how different columns corelate to each other. The coefficients range between -1 and 1.
# The closer the values are to -1 indicates that the variables do not correlate while the closer the values are to 1 indicates that the values have a high correlation.
# A correlation matrix is very important when we are trying to understand our data as it serves as input for advanced analysis.
# Uncomment the line below after running previous lines
df.corr()

                    age  preTestScore  postTestScore
age            1.000000     -0.105651       0.328852
preTestScore  -0.105651      1.000000       0.378039
postTestScore  0.328852      0.378039       1.000000

In [0]:
# Example 2
# Apply Operations To Groups In Pandas
#

# Create dataframe
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'name', 'preTestScore', 'postTestScore'])
df

# Create a groupby variable that groups preTestScores by regiment
# Uncomment the line below after running previous lines
# groupby_regiment = df['preTestScore'].groupby(df['regiment'])
# groupby_regiment

# Descriptive statistics by group
# Uncomment the line below after running previous lines
# df['preTestScore'].groupby(df['regiment']).describe()

# Mean of each regiment’s preTestScore
# Uncomment the line below after running previous lines
# groupby_regiment.mean()

# Mean preTestScores grouped by regiment and company
# Uncomment the line below after running previous lines
# df['preTestScore'].groupby([df['regiment'], df['company']]).mean()

# Number of observations in each regiment and company
# Uncomment the line below after running previous lines
# df.groupby(['regiment', 'company']).size()

In [0]:
# Example 3
# Random Sampling Dataframe
# 

raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'], 
        'age': [42, 52, 36, 24, 73], 
        'preTestScore': [4, 24, 31, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])
df

# Select a random subset of 2 without replacement
# Uncomment the line below after running previous lines
# df.take(np.random.permutation(len(df))[:2])

In [223]:
# Example 4
# Pivot Tables In pandas
#

# Create dataframe
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'TestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'TestScore'])
df

# Create a pivot table of group means, by company and regiment
# Uncomment the line below after running previous lines
pd.pivot_table(df, index=['regiment','company'], aggfunc='mean')

# Create a pivot table of group score counts, by company and regiments
# Uncomment the line below after running previous lines
df.pivot_table(index=['regiment','company'], aggfunc='count')

                    TestScore
regiment   company
Dragoons   1st              2
           2nd              2
Nighthawks 1st              2
           2nd              2
Scouts     1st              2
           2nd              2

### <font color="green">1.5 Challenges</font>

In [0]:
# Challenge 1
# Using the given dataset, calculate the descriptive statistics of the total population
# url = http://bit.ly/KePopulationDistribution1
#

# The total population in Kenya
OUR CODE GOES HERE

# The average population per urban center 
 

# The total urban population fo the cities 
 

# Summary statistics on total population
 

# Count the number municipalities in the country


# Which municipality/city/other/town is the most sparcely populated 


# Which municipality/city/other/town is the most densely populated 

# Median value of the total population 


# Sample variance of the total population


# Sample standard deviation of the total population


# Correlation of the variables in the given dataset

In [0]:
# Challenge 2
# Using the given dictionary below, find out the mean and median of the points during the Years
# 

kenyan_premier_league = {'Team': ['Gor Mahia', 'AFC', 'Mathare', 'Ushuru', 'Kariobangi Sharks',
   'Tusker', 'Bandari', 'Mumias', 'Thika Utd', 'Kakamega', 'Nakuru Utd', 'Kibera Utd'], 
   'Year': [2018, 2019, 2017, 2019, 2017, 2019, 2016, 2017, 2016, 2018, 2019, 2017],
   'Points':[87, 78, 86, 67, 74, 81, 75, 78, 69, 70, 80, 69]}

OUR CODE GOES HERE

In [0]:
# Challenge 3
# Randomly select a municipality without replacement from the following dataset
# url = http://bit.ly/KePopulationDistribution1
# 
OUR CODE GOES HERE

In [0]:
# Challenge 4
# From the given dataset, create a pivot table of sum total population by District 
#
OUR CODE GOES HERE

In [0]:
# Challenge 5
# From the given dataset, create a pivot table of sum total population by District 
# url = http://bit.ly/KePopulationDistribution1
# 
OUR CODE GOES HERE